source/3_Part.org
 #+STARTUP:indent
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/styles.css"/>
#+HTML_HEAD_EXTRA: <link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
#+OPTIONS: f:nil author:nil num:1 creator:nil timestamp:nil  
#+TITLE: Python Key Skills - 3
#+AUTHOR: X. Ellis

* COMMENT Use as a template
:PROPERTIES:
:HTML_CONTAINER_CLASS: activity
:END:
** Learn It
:PROPERTIES:
:HTML_CONTAINER_CLASS: learn
:END:

** Research It
:PROPERTIES:
:HTML_CONTAINER_CLASS: research
:END:

** Design It
:PROPERTIES:
:HTML_CONTAINER_CLASS: design
:END:

** Build It
:PROPERTIES:
:HTML_CONTAINER_CLASS: build
:END:

** Test It
:PROPERTIES:
:HTML_CONTAINER_CLASS: test
:END:

** Run It
:PROPERTIES:
:HTML_CONTAINER_CLASS: run
:END:

** Document It
:PROPERTIES:
:HTML_CONTAINER_CLASS: document
:END:

** Code It
:PROPERTIES:
:HTML_CONTAINER_CLASS: code
:END:

** Program It
:PROPERTIES:
:HTML_CONTAINER_CLASS: program
:END:

** Try It
:PROPERTIES:
:HTML_CONTAINER_CLASS: try
:END:

** Badge It
:PROPERTIES:
:HTML_CONTAINER_CLASS: badge
:END:

** Save It
:PROPERTIES:
:HTML_CONTAINER_CLASS: save
:END:

* Python Key Skills 3
:PROPERTIES:
:HTML_CONTAINER_CLASS: activity
:END:
** Learn It - Change a string to all upper case or lower case
:PROPERTIES:
:HTML_CONTAINER_CLASS: learn
:END:
 
*** change a string to all upper case
+ Python has a built-in function for this.
#+BEGIN_SRC

myString = "Hello world!"
print(myString.upper())

#+END_SRC
+ the above code will print out "HELLO WORLD!".BUT
+ the variable myString is not changed. To change variable myString you need to re-assign the value to it.
#+BEGIN_SRC 
myString = "Hello world!"
myString = myString.upper()
#+END_SRC

 
*** change a string to all lower case
+ Python has a built-in function for this.
#+BEGIN_SRC

myString = "Hello world!"
print(myString.lower())

#+END_SRC
+ the above code will print out "hello world!".BUT
+ the variable myString is not changed. To change variable myString you need to re-assign the value to it.
#+BEGIN_SRC 
myString = "Hello world!"
myString = myString.lower()
#+END_SRC

 
*** To extract any part of a string
+ Python treats string as a list of characters with index.
+ in the string "I love cheese", the character "I" will have an index 0, followed by a space with an index 2, and so on.
#+BEGIN_SRC

myString = "I love cheese"
# To get the first letter/character
firstChar = myString[0]

# To get the last letter/character
lastChar = myString[-1]

# To get the last 4 letters/characters
last4Chars = myString[-4:0]


# To get the first 4 letters/characters
first4Chars = myString[0:4]

# To get the letters/characters between index 3 and 5
last4Chars = myString[3:6]

# To get the letters/characters starting from 3 but skipping one between until index 8
last4Chars = myString[3:8:2]

#+END_SRC





