pages/3_Part.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Python Key Skills - 3</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="css/styles.css"/>
<link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">Python Key Skills - 3</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Python Key Skills 3</a>
<ul>
<li><a href="#sec-1-1">Learn It - Change a string to all upper case or lower case</a>
<ul>
<li><a href="#sec-1-1-1">change a string to all upper case</a></li>
<li><a href="#sec-1-1-2">change a string to all lower case</a></li>
<li><a href="#sec-1-1-3">To extract any part of a string</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2 activity">
<h2 id="sec-1"><span class="section-number-2">1</span> Python Key Skills 3</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3 learn">
<h3 id="sec-1-1">Learn It - Change a string to all upper case or lower case</h3>
<div class="outline-text-3" id="text-1-1">
</div>

<div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1">change a string to all upper case</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li>Python has a built-in function for this.
</li>
</ul>
<pre class="example">
myString = "Hello world!"
print(myString.upper())
</pre>
<ul class="org-ul">
<li>the above code will print out "HELLO WORLD!".BUT
</li>
<li>the variable myString is not changed. To change variable myString you need to re-assign the value to it.
</li>
</ul>
<pre class="example">
myString = "Hello world!"
myString = myString.upper()
</pre>
</div>
</div>


<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2">change a string to all lower case</h4>
<div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li>Python has a built-in function for this.
</li>
</ul>
<pre class="example">
myString = "Hello world!"
print(myString.lower())
</pre>
<ul class="org-ul">
<li>the above code will print out "hello world!".BUT
</li>
<li>the variable myString is not changed. To change variable myString you need to re-assign the value to it.
</li>
</ul>
<pre class="example">
myString = "Hello world!"
myString = myString.lower()
</pre>
</div>
</div>


<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3">To extract any part of a string</h4>
<div class="outline-text-4" id="text-1-1-3">
<ul class="org-ul">
<li>Python treats string as a list of characters with index.
</li>
<li>in the string "I love cheese", the character "I" will have an index 0, followed by a space with an index 2, and so on.
</li>
</ul>
<pre class="example">
myString = "I love cheese"
# To get the first letter/character
firstChar = myString[0]

# To get the last letter/character
lastChar = myString[-1]

# To get the last 4 letters/characters
last4Chars = myString[-4:0]


# To get the first 4 letters/characters
first4Chars = myString[0:4]

# To get the letters/characters between index 3 and 5
last4Chars = myString[3:6]

# To get the letters/characters starting from 3 but skipping one between until index 8
last4Chars = myString[3:8:2]
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
